dic = { '.-':'A','-...':'B','-.-.':'C','-..':'D','.':'E',
       '..-.':'F','--.':'G', '....':'H','..':'I','.---':'J',
       '-.-':'K','.-..':'L', '--':'M','-.':'N','---':'O',
       '.--.':'P','--.-':'Q','.-.':'R', '...':'S','-':'T',
       '..-':'U','...-':'V','.--':'W','-..-':'X', '-.--':'Y','--..':'Z' 
    }

def morse(src):
    result = []
    for word in src.split("  "):
        for char in word.split(" "):
            result.append(dic[char])
        result.append(" ")
    return "".join(result)

print(morse('.... . ... .-.. . . .--. ... . .- .-. .-.. -.--'))
#HE라는 글자를 모스부호로 입력